Catalogs/ПодпискиНаОчередиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодпискиНаОчередиСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеЗадания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОжиданияСобытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Асинхронно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОчередьСообщенийПовтИсп/Ext/Module.bsl
// Позволяет клиентской конфигурации предоставить параметры соединения с RMQ
//
Процедура ПрисвоитьПараметрыАвторизации(
		Адрес,
		Порт,
		Логин,
		Пароль,
		ВиртуальныйХост
	) Экспорт
	
	Адрес = Константы.AMQP_Адрес.Получить();
	Порт = Число(Константы.AMQP_Порт.Получить());
	Логин = Константы.AMQP_Логин.Получить();
	Пароль = Константы.AMQP_Пароль.Получить();
	ВиртуальныйХост = Константы.AMQP_ВиртуальныйХост.Получить();
		
КонецПроцедуры

Функция ПолучитьИмяОчередиBIT_MDM() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодпискиНаОчередиСообщений.ИмяОчереди
	|ИЗ
	|	Справочник.ПодпискиНаОчередиСообщений КАК ПодпискиНаОчередиСообщений
	|ГДЕ
	|	ПодпискиНаОчередиСообщений.Наименование = ""BIT_MDM""
	|	И ПодпискиНаОчередиСообщений.Активно = ИСТИНА
	|	И ПодпискиНаОчередиСообщений.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИмяОчереди;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
